Repository: Piwigo/Piwigo-Mobile
Catalog: piwigo/Resources/ReleaseNotes.xcstrings
Source language: en
Languages: ar, da, de, es, fr, hu, id, it, ja, nl, pl, ru, sv, zh_hans, zh_hant

# v2.4.6_text
source: Version 2.4.6 January 18, 2020 • Edit properties of a selection of photos • Change creation date of a photo or video • Option for prefixing file names before upload • Minor bug fixes and improvements of the interface
da: Version 2.4.6 18 januar 2020 • Rediger egenskaber for et udvalg af billeder • Skift oprettelsesdato for et billede eller en video • Mulighed for præfiksering af filnavne inden upload • Mindre fejlrettelser og forbedringer af grænsefladen
de: Version 2.4.6 18. Januar 2020 • Bearbeiten der Eigenschaften einer Auswahl von Fotos • Ändern des Erstellungsdatums eines Fotos oder Videos • Präfix für Dateinamen vor dem Hochladen • Kleinere Fehlerbehebungen und Verbesserungen der Benutzeroberfläche
es: Versión 2.4.6 18 de enero 2020 • Editar las propiedades de una selección de fotos • Cambiar la fecha de creación de una foto o vídeo • Opción para añadir un prefijo a los nombres de archivo antes de subirlos • Corrección de errores menores y mejoras en la interfaz
fr: Version 2.4.6 18 janvier 2020 • Ajoute la modification des propriétés d'une sélection de photos • Modifier la date de création d'une photo ou d'une vidéo • Option pour préfixer les noms de fichier avant téléversement • Corrige des bugs mineurs et améliore l'interface
hu: 2.4.6-os verzió 2020 Január 18 • Kiválasztott fotók tulajdonságainak szerkesztése • Fotók és videók létrehozási dátumának változtatása • Fájlnevek feltöltés előtti előtagozásának lehetősége • Kisebb hibajavítások és fejlesztések a felületen
id: Versi 2.4.6 18 Januari 2020 • Edit properti dari pilihan foto • Ubah tanggal pembuatan foto atau video • Opsi untuk awalan nama file sebelum diunggah • Perbaikan bug minor dan peningkatan antarmuka
it: Versione 2.4.6 18 gennaio 2020 • Modifica le proprietà di una selezione di foto • Cambia la data di creazione di una foto o un video • Opzione per la prefissione dei nomi di file prima di caricare • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン 2.4.6 2020年1月18日 • 写真選択のプロパティを編集 • 写真またはビデオの作成日を変更する • アップロード前にファイル名にプレフィックスを付けるオプション • 軽微なバグの修正とインタフェースの改善
nl: Versie 2.4.6 18 januari 2020 • Bewerk eigenschappen van een selectie foto's • Verander aanmaakdatum van foto of video • Optie voor voorvoegsel bestandsnaam voor upload • Kleine foutjes verbeterd en verbetering van de interface
pl: Wersja 2.4.6 18 stycznia 2020 • Możliwość edycji właściwości wybranych zdjęć • Możliwość zmiany daty utworzenia zdjęcia lub filmu • Opcja dodania prefiksu nazw plików przed przesłaniem • Poprawki drobnych błędów i ulepszenia interfejsu
ru: Версия 2.4.6 18 января 2020 • Изменить свойства выбора фотографий • Изменить дату создания фото или видео • Опция префикса имен файлов перед загрузкой • Незначительные исправления ошибок и улучшения интерфейса
sv: Version 2.4.6 18 januari 2020 • Redigera egenskaper för ett urval av foton • Ändra datum för att skapa ett foto eller en video • Alternativ för att prefix filnamn innan du laddar upp • Mindre buggfixar och förbättringar av gränssnittet
zh_hans: 版本2.4.6 2020年1月18日 • 修改了选中照片的属性 • 更改了照片或视频的创建日期 • 新增在上传前预设文件名的选项 • 错误修复和界面改进
zh_hant: 版本 2.4.6 2020年1月18日 • 可以一次選擇多個照片並更改內容 • 更改照片或影片的建立日期 • 新增在上傳之前增加檔名前綴的選項 • 小型錯誤修正及介面改進

# v2.4.7_text
source: Version 2.4.7 January 30, 2020 • Chinese Simplified, Russian and Spanish translations • Fixes a video playback issue on some servers
da: Version 2.4.7 30 januar 2020 • Kinesisk forenklet, russisk og spansk oversættelse • Løser et videoafspilningsproblem på nogle servere
de: Version 2.4.7 30. Januar 2020 • Übersetzungen Chinesisch vereinfacht, Russisch und Spanisch • Behebt ein Problem bei der Videowiedergabe auf einigen Servern
es: Versión 2.4.7 30 de enero 2020 • Traducciones al chino simplificado, ruso y español • Soluciona un problema de reproducción de vídeo de algunos servidores
fr: Version 2.4.7 30 janvier 2020 • Traduction en chinois simplifié, Russe et Espagnol • Résout un problème de lecture vidéo sur certains serveurs
hu: 2.4.7-es verzió 2020 Január 30 • Egyszerűsített Kínai, Orosz és Spanyol fordítások • Javítja a videó-lejátszás hibáját néhány szerveren
id: Versi 2.4.7 30 Januari 2020 • Terjemahan Mandarin Sederhana, Rusia dan Spanyol • Memperbaiki masalah pemutaran video pada beberapa server
it: Versione 2.4.7 30 gennaio 2020 • Traduzione cinese semplificata, russa e spagnola • Risolve un problema di riproduzione video su alcuni server
ja: バージョン2.4.7 2020年1月30日 •簡体字中国語、ロシア語、スペイン語の翻訳 •一部のサーバーでのビデオ再生の問題を修正
nl: Versie 2.4.7 30 januari 2020 • Chinese vereenvoudigd, Russisch en Spaans vertalingen • Corrigeert een video afspeelprobleem op sommige servers
pl: Wersja 2.4.7 30 stycznia 2020 • Dodano tłumaczenia: chiński (uproszczony), rosyjski i hiszpański • Naprawiono problem z odtwarzaniem filmów na niektórych serwerach
ru: Версия 2.4.7 30 января 2020 • Упрощенный китайский, русский и испанский переводы • Исправлена проблема воспроизведения видео на некоторых серверах
sv: Version 2.4.7 30 januari 2020 • Kinesiska, förenklade, ryska och spanska översättningar • Fixar ett videouppspelningsproblem på vissa servrar
zh_hans: 版本2.4.7 2020年1月30日 • 新增简体中文，俄文和西班牙文翻译 • 修复了某些服务器上的视频播放问题
zh_hant: 版本 2.4.7 2020年1月30日 • 簡體中文，俄語，西班牙語翻譯 • 修正在部分伺服器上的影片播放問題

# v2.4.8_text
source: Version 2.4.8 March 25, 2020 • Piwigo warns you when: - a website has a certificate that is not valid, - before establishing an insecure connection • Improved cache management • Minor bug fixes and improvements of the interface
da: Version 2.4.8 25 marts 2020 • Piwigo advarer dig, når: - et websted har et certifikat, der ikke er gyldigt, - inden du opretter en usikker forbindelse • Forbedret cachehåndtering • Mindre fejlrettelser og forbedringer af grænsefladen
de: Version 2.4.8 25. März 2020 • Piwigo warnt Sie, wenn: - eine Webseite hat ein nicht gültiges Zertifikat, - Vor dem Aufbau einer unsicheren Verbindung. • Verbessertes Cache-Management • Kleinere Fehlerbehebungen und Verbesserungen der Schnittstelle
es: Versión 2.4.8 25 de marzo de 2020 • Piwigo te advierte cuando: - un sitio web tiene un certificado que no es válido, - antes de establecer una conexión insegura • Gestión de caché mejorada • Correcciones y mejoras menores de la interfaz
fr: Version 2.4.8 25 mars 2020 • Piwigo vous avertit quand : - un site web a un certificat qui n'est pas valide, - avant d'établir une connexion non sécurisée. • Amélioration de la gestion du cache • Corrections de bugs mineurs et améliorations de l'interface
hu: 2.4.8-as verzió 2020 Március 25 • A Piwigo figyelmeztet, amikor: - a weboldal tanúsítványa nem megfelelő, - nem biztonságos kapcsolat létrehozásakor • Továbbfejlesztett gyorsítótár-menedzsment • Kisebb hibajavítások és fejlesztések a felületen
id: Versi 2.4.8 25 Maret 2020 • Piwigo memperingatkan Anda ketika: - situs web memiliki sertifikat yang tidak valid, - sebelum membuat koneksi yang tidak aman • Peningkatan manajemen cache • Perbaikan bug minor dan peningkatan antarmuka
it: Versione 2.4.8 25 marzo 2020 • Piwigo ti avverte quando: - un sito web dispone di un certificato non valido, - prima di stabilire una connessione non sicura • Migliorata gestione cache • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン2.4.8 2020年3月25日 •Piwigoは次の場合に警告します。 -ウェブサイトに無効な証明書がある -安全でない接続を確立する前 •キャッシュ管理の改善 •マイナーなバグ修正とインターフェイスの改善
nl: Versie 2.4.8 25 maart 2020 • Piwigo waarschuwt je wanneer: - een website heeft een certificaat dat niet geldig is, - voor het opzetten van een onveilige verbinding • Verbeterd cachebeheer • Kleine foutjes gerepareerd en verbeteringen van de interface
pl: Wersja 2.4.8 25 marca 2020 • Piwigo ostrzega, kiedy: - strona internetowa posiada niepoprawny certyfikat, - próbujesz ustanowić niezabezpieczone połączenie • Ulepszone zarządzanie pamięcią podręczną • Poprawki drobnych błędów i ulepszenia interfejsu
ru: Версия 2.4.8 25 марта 2020 • Piwigo предупредит Вас, когда: - на сайте установлен недействительный сертификат, - перед установлением небезопасного соединения • Улучшение управления кэшами • Незначительные исправления и улучшения интерфейса
sv: Version 2.4.8 25 mars 2020 • Piwigo varnar dig när: - en webbplats har ett certifikat som inte är giltigt, - innan du upprättar en osäker anslutning • Förbättrad cachehantering • Mindre buggfixar och förbättringar av gränssnittet
zh_hans: 版本 2.4.8 2020年3月25日 • 新增以下警告条件： - 网站证书不可信 - 建立的连接不安全 • 增强缓存管理机制 • 错误修复和界面改进
zh_hant: 版本 2.4.8 2020年3月25日 • Piwigo會在以下狀況時警告你: - 當一個網站的證書無效時， - 在開始一個不安全的連線前 • 改進快取管理 • 小型錯誤修正及介面改進

# v2.5.0_text
source: Version 2.5 August 27, 2020 • Records upload requests • Uploads photos/videos when possible • "Wi-Fi only" option for uploads • No upload when in Low Power Mode • Much faster access to the Photo Library • Minor bug fixes and improvements of the interface • Code modernization Background uploading will be available after a server update.
da: Version 2.5 27 august 2020 • Optegnelser upload anmodninger • Uploader fotos/videoer, når det er muligt • "Kun Wi-Fi" mulighed for uploads • Ingen upload ved lav strømtilstand • Meget hurtigere adgang til Fotobiblioteket • Mindre fejlrettelser og forbedringer af brugerflade • Modernisering af kode Baggrundsupload vil være tilgængelig efter en serveropdatering.
de: Version 2.5 27. August 2020 • Zeichnet Upload-Anforderungen auf • lädt Fotos/Videos hoch, wenn möglich • Option "Nur WLAN" für Uploads • Kein Hochladen im Energiesparmodus • Deutlich schnellerer Zugriff auf die Fotobibliothek • Kleinere Fehlerbehebungen und Verbesserungen der Schnittstelle • Code-Modernisierung Das Hochladen im Hintergrund wird nach einem Server-Update verfügbar sein.
es: Versión 2.5 27 de agosto de 2020 • Registra solicitudes de subida • Sube fotos/vídeos cuando es posible • Opción "Sólo Wi-Fi" para subidas • No realizar subidas cuando se está en modo de ahorro de batería • Acceso mucho más rápido a la Biblioteca de Fotos • Correcciones de errores menores y mejoras de la interfaz • Modernización del código La subida en segundo plano estará disponible después de una actualización de servidor.
fr: Version 2.5 27 août 2020 • Enregistre les demandes de téléchargements • Télécharge les photos/vidéos sur le serveur Piwigo lorsque c'est possible • Pas de téléchargement lorsque le mode Economie d'Energie est activé • Option "Wi-Fi uniquement" pour les téléchargements • Accès beaucoup plus rapide à la Photothèque • Corrections de bugs mineurs et améliorations de l'interface • Modernisation du code Le téléchargement en arrière-plan sera disponible après une mise à jour du serveur.
hu: 2.5-ös verzió 2020 Augusztus 27 • Feltöltési kérelmek rögzítése • Fotók és videók feltöltése, mikor az lehetséges • "Csak Wi-Fi-n" opció a feltöltésekhez • Nincs feltöltés "Alacsony töltöttségű mód"-ban • Sokkal gyorsabb hozzáférés a fotókönyvtárhoz • Kisebb hibajavítások és fejlesztések a felületen • Kódmodernizálás A háttérfeltöltéshez a szervert is frissíteni kell.
it: Versione 2.5 27 agosto 2020 • Richieste di caricamento delle registrazioni • Quando possibile Carica foto/video • Opzione "solo Wi-Fi" per i caricamenti • Nessun caricamento quando in modalità a basso consumo • Accesso molto più veloce alla Libreria foto • Correzioni di bug minori e miglioramenti dell'interfaccia • Modernizzazione del codice Il caricamento dello sfondo sarà disponibile dopo un aggiornamento del server.
ja: バージョン 2.5 2020年8月27日 • アップロード要求を記録する • 可能であれば写真/ビデオをアップロードする • アップロードのための「Wi-Fiのみ」オプション • 低電力モードであればアップロードしない • フォトライブラリへのアクセスの高速化 • 軽微なバグの修正とインタフェースの改善 • コードの近代化 バックグラウンドアップロードはサーバの更新後に利用可能になります。
nl: Versie 2.5 27 augustus 2020 • Records upload requests • Uploaden van foto's/video's indien mogelijk • "Alleen Wi-Fi" optie voor uploaden • Geen upload als in Low Power Modus • Veel snellere toegang tot de Photo Library • Kleine foutjes hersteld en verbetering van de interface • Code modernisatie Achtergrond uploaden zal beschikbaar zijn na een server update.
pl: Wersja 2.5 27 sierpnia 2020 • Rejestracja żądań przesyłania • Przesyłanie zdjęć i filmów w miarę możliwości • Opcja przesyłania tylko przez Wi-Fi • Zawieszanie przesyłania w trybie oszczędzania energii • Znacznie szybszy dostęp do biblioteki zdjęć • Poprawki drobnych błędów i ulepszenia interfejsu • Modernizacja kodu Przesyłanie w tle będzie dostępne po uaktualnieniu serwera.
ru: Версия 2.5 27 августа 2020 • Запись запроса на загрузку • Загрузка фотографий/видео при возможности • Опция "только Wi-Fi" для загрузок • Приостановка загрузки при Низком Заряде Батареи • Значительно возросшая скорость доступа к Библиотеке Фотографий • Мелкие исправления и улучшения интерфейса • Модернизация кода Загрузка в фоне будет доступна после обновления сервера.
sv: Version 2.5 27 augusti 2020 • Records upload requests • Uploads photos/videos when possible • "Wi-Fi only" option for uploads • No upload when in Low Power Mode • Mycket snabbare tillgång till fotobiblioteket • Mindre buggfixar och förbättringar av gränssnittet • Uppdatering av kod Bakgrundsuppladdning kommer att vara tillgänglig efter en serveruppdatering.
zh_hans: 版本 2.5 2020年8月27日 • 支持记录上传请求 • 自动上传图片与视频 • 支持仅Wi-Fi上传功能 • 在低电量模式情况下不进行上传 • 访问图库速度更快 • 各种错误修复与界面改进 • 代码质量提升 自动上传功能需要服务器端升级后才能使用
zh_hant: 版本 2.5 2020年8月27日 • 紀錄上傳要求 • 可以時上傳照片及影片 • "僅限Wi-Fi"的上傳功能 • 低耗電模式關閉上傳 • 更快的讀取照片圖庫 • 小型錯誤修正及介面改進 • 程式碼更新

# v2.5.1_text
source: Version 2.5.1 September 10, 2020 • New option for presenting the photos and videos in random order • Minor bug fixes and improvements of the interface
da: Version 2.5.1 10 september 2020 • Ny mulighed for at præsentere fotos og videoer i tilfældig rækkefølge • Mindre fejlrettelser og forbedringer af brugerflade
de: Version 2.5.1 10. September 2020 • Neue Option für die Darstellung der Fotos und Videos in zufälliger Reihenfolge • Kleinere Fehlerbehebungen und Verbesserungen der Benutzeroberfläche
es: Versión 2.5.1 10 de septiembre de 2020 • Nueva opción para presentar las fotos y vídeos en orden aleatorio • Correcciones menores de errores y mejoras de la interfaz
fr: Version 2.5.1 10 septembre 2020 • Nouvelle option de présentation aléatoire des photos et des vidéos • Corrections de bugs mineurs et améliorations de l'interface
hu: 2.5.1-es verzió 2020 Szeptember 10 • Új opció a fotók is videók véletlenszerű bemutatásához • Kisebb hibajavítások és fejlesztések a felületen
it: Versione 2.5.1 10 settembre 2020 • Nuova opzione per la presentazione di foto e video in ordine casuale • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン 2.5.1 2020年9月10日 • 写真やビデオをランダムに表示する新しいオプション • 軽微なバグの修正とインタフェースの改善
nl: Versie 2.5.1 10 September 2020 • Nieuwe optie voor het presenteren van foto's en video's in willekeurige volgorde • Kleine foutjes verbeterd en verbetering van de interface
pl: Wersja 2.5.1 10 września 2020 • Nowa opcja prezentowania zdjęć i filmów w losowej kolejności • Poprawki drobnych błędów i ulepszenia interfejsu
ru: Версия 2.5.1 10 сентября 2020 • Новая возможность представления фото и видео в случайном порядке • Незначительные исправления ошибок и улучшения интерфейса
sv: Version 2.5.1 10 september 2020 • Nytt alternativ för att presentera foton och videor i slumpmässig ordning • Mindre buggfixar och förbättringar av gränssnittet
zh_hans: 版本 2.5.1 2020年9月10日 • 新增选项，支持以随机顺序展示照片和视频 • 错误修复和界面改进
zh_hant: 版本 2.5.1 2020年9月10日 • 檢視照片及影片時新增隨機排序選項 • 小型錯誤修正及介面改進

# v2.5.2_text
source: Version 2.5.2 December 3, 2020 • Background uploading (requires the uploadAsync extension or Piwigo 11 or later) • Minor bug fixes and improvements of the interface
da: Version 2.5.2 3 december 2020 • Baggrund uploader (kræver uploadAsync-udvidelse eller Piwigo 11 eller nyere) • Mindre fejlrettelser og forbedringer af brugerflade
de: Version 2.5.2 3. Dezember 2020 • Hochladen im Hintergrund (erfordert die Erweiterung uploadAsync oder Piwigo 11 und höher) • Kleinere Fehlerbehebungen und Verbesserungen der Benutzeroberfläche
es: Versión 2.5.2 3 de diciembre de 2020 • Subida en segundo plano (requiere la extensión uploadAsync o Piwigo 11 o posterior) • Correcciones menores de errores y mejoras de la interfaz
fr: Version 2.5.2 3 décembre 2020 • Téléchargement en arrière-plan (nécessite l'extension uploadAsync ou Piwigo 2.11 ou ultérieure) • Corrections de bugs mineurs et améliorations de l'interface
hu: 2.5.2-es verzió 2020 December 3 • Feltöltés a háttérben (kell hozzá az uploadAsync bővítmény, vagy Piwigo 11 vagy újabb) • Kisebb hibajavítások és fejlesztések a felületen
it: Versione 2.5.2 3 dicembre 2020 • Caricamento in background (richiede l'estensione uploadAsync o Piwigo 11 o successivo) • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン 2.5.2 2020年12月3日 • 背景のアップロード（uploadAsync拡張機能またはPiwigo 11以降が必要） • 軽微なバグの修正とインタフェースの改善
nl: Versie 2.5.2 3 December 2020 • Achtergrond uploaden (vereist de uploadAsync-extensie of Piwigo 11 of hoger) • Kleine foutjes gerepareerd en verbetering van de interface
pl: Wersja 2.5.2 3 grudnia 2020 • Przesyłanie w tle (wymaga rozszerzenia uploadAsync lub Piwigo 2.11 lub nowszego) • Poprawki drobnych błędów i ulepszenia interfejsu
ru: Версия 2.5.2 3 февраля 2020 • Загрузка фона (требуется расширение uploadAsync или Piwigo 11 или новее) • Исправления мелких ошибок и улучшения интерфейса
sv: Version 2.5.2 3 december 2020 • Bakgrundsuppladdning (kräver uploadAsync-tillägg eller Piwigo 11 eller senare) • Mindre buggfixar och förbättringar av gränssnittet
zh_hans: 版本 2.5.2 2020年12月3日 • 后台上传（需要uploadAsync扩展或Piwigo 11以上版本） • 小错误修复和界面改进
zh_hant: 版本 2.5.2 2020年12月3日 • 背景上傳 (需要uploadAsync插件或Piwigo 11以上) • 小型錯誤修正及介面改進

# v2.5.3_text
source: Version 2.5.3 December 21, 2020 • Control which photos and videos Piwigo can access • Tips and tricks for better exploiting the app • Bug fixes
da: Version 2.5. 21 december 2020 • Kontrollér, hvilke billeder og videoer Piwigo kan tilgå • Tips og tricks for bedre at udnytte appen • Fejlrettelser
de: Version 2.5. 21. Dezember 2020 • Kontrollieren Sie, auf welche Fotos und Videos Piwigo zugreifen kann • Tipps und Tricks zur besseren Nutzung der App • Fehlerbehebungen
es: Versión 2.5.3 21 de diciembre de 2020 • Control de a qué fotos y vídeos puede acceder Piwigo • Consejos y trucos para aprovechar mejor la aplicación • Corrección de errores
fr: Version 2.5.3 21 décembre 2020 • Contrôle des photos et vidéos auxquelles Piwigo peut accéder • Conseils et astuces pour mieux exploiter l'application • Corrections de bugs
hu: 2.5.3-as verzió 2020 December 21 • Piwigo fotó- és videóhozzáférésének vezérlése • Tippek és trükkök az alkalmazás gyorsabb megértése érdekében • Hibajavítások
it: Versione 2.5.3 21 dicembre 2020 • Controlla quali foto e video Piwigo può accedere a • Suggerimenti e trucchi per sfruttare al meglio l'app • Correzioni di bug
ja: バージョン 2.5.3 2020年12月21日 • Piwigoがアクセスできる写真やビデオを制御する • アプリを悪用するためのヒントとトリック • バグ修正
nl: Versie 2.5.3 21 December 2020 • Bepaal welke foto's en video's Piwigo toegang hebben tot • Tips en trucs voor een betere exploitatie van de app • Foutjes verbeterd
pl: Wersja 2.5.3 21 grudnia 2020 • Kontroluj, do których zdjęć i filmów Piwigo ma dostęp • Wskazówki i porady, aby lepiej wykorzystywać aplikację • Poprawki błędów
ru: Версия 2.5.3 21 февраля 2020 • Контролируйте доступ к фотографиям и видео Piwigo • Советы и трюки для лучшего использования приложения • Исправления ошибок
sv: Version 2.5.3 21 december 2020 • Kontrollera vilka foton och videor Piwigo kan komma åt • Tips och tricks för att bättre utnyttja appen • Felrättelser
zh_hans: 版本2.5.3 2020年12月21日 • 支持控制Piwigo可以访问哪些照片和视频 • 新增小提示，帮助用户更好地利用应用程序 • Bug修复
zh_hant: 版本 2.5.3 2020年12月21日 • 控制Piwigo可以讀取哪些照片及影片 • 新增小提示，幫助用戶善加利用此應用程式 • 錯誤修正

# v2.5.4_text
source: Version 2.5.4 January 2, 2021 • Minor bug fixes and improvements of the interface
da: Version 2.5.4 2 januar 2021 • Mindre fejlrettelser og forbedringer af brugerflade
de: Version 2.5.4 2. Januar 2021 • Kleinere Fehlerbehebungen und Verbesserungen der Benutzeroberfläche
es: Versión 2.5.4 2 de enero 2021 • Corrección de errores menores y mejoras en la interfaz
fr: Version 2.5.4 2 janvier 2021 • Corrige des bugs mineurs et améliore l'interface
hu: 2.5.4-es verzió 2021 Január 2 • Kisebb hibajavítások és fejlesztések a felületen
it: Versione 2.5.4 2 gennaio 2021 • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン 2.5.4 2021年1月2日 • 軽微なバグの修正とインタフェースの改善
nl: Versie 2.5.4 2 januari 2021 • Kleine foutjes verbeterd en verbetering van de interface
pl: Wersja 2.5.4 2 stycznia 2021 • Poprawki drobnych błędów i ulepszenia interfejsu
ru: Версия 2.5.4 2 января 2021 • Незначительные исправления ошибок и улучшения интерфейса
sv: Version 2.5.4 2 januari 2021 • Mindre buggfixar och förbättringar av gränssnittet
zh_hans: 版本 2.5.4 2021年1月2日 • 错误修复和界面改进
zh_hant: 版本 2.5.4 2021年1月2日 • 小型錯誤修正及介面改進
